import { getSystemMetrics } from './system';

export async function getFormattedMenu(): Promise<string> {
  const metrics = await getSystemMetrics();

  return `⬩Ｍ Ｕ Ｇ Ｅ Ｎ     Ｋ Ｉ Ｋ Ａ Ｉ⬩
⬩╭────────────╮ 
⬩                                ╰──────╯⬩
 ${metrics.progressBar}    𝗟𝗢𝗔𝗗: ${metrics.loadPercent}%
⬩                                ╭──────╮⬩
⬩╰────────────╯


---------- [ *𝘚 𝘠 𝘚 - 𝘚 𝘛 𝘈 𝘛 𝘜 𝘚* ] ---------
𝗥𝗨𝗡𝗧𝗜𝗠𝗘:             ${metrics.runtime}   𝗥𝗔𝗠_𝗨𝗦𝗔𝗚𝗘:       ${metrics.ramUsage}

 ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓

*𝑫𝒆𝒔𝒕𝒓𝒖𝒄𝒕𝒊𝒐𝒏 𝒊𝒔 𝒐𝒏𝒍𝒚 𝒋𝒖𝒔𝒕𝒊𝒇𝒊𝒂𝒃𝒍𝒆 𝒇𝒐𝒓 𝒓𝒆𝒎𝒐𝒅𝒆𝒍, 𝒏𝒆𝒗𝒆𝒓 𝒅𝒆𝒔𝒕𝒓𝒐𝒚, 𝑩𝒖𝒊𝒍𝒅/𝑪𝒓𝒆𝒂𝒕𝒆!*       
                                               ~frio ⬩
‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬▬▬▬▬ ⬩ 𝗕 𝗢 𝗧 
 ❏ ᴏᴡɴᴇʀ
 ❏ ᴜᴘᴅᴀᴛᴇs
 ❏ ᴘɪɴɢ
 ❏ ʜᴇʟᴘ
 ❏ ᴍᴇɴᴜ
 ❏ ʀᴜɴᴛɪᴍᴇ

⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬▬▬▬ ⬩ 𝗨 Ｓ Ｅ 𝗥
 ❏ ᴘʀᴏғɪʟᴇ 

⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬▬ ⬩ Ｅ Ｃ Ｏ Ｎ Ｏ Ｍ Ｙ 
 ❏ ғɪʀsᴛᴄʟᴀɪᴍ  
 ❏ ᴄʟᴀɪᴍ 
 ❏ ᴡᴀʟʟᴇᴛ 
 ❏ ᴅᴇᴘᴏsɪᴛ 
 ❏ ᴡɪᴛʜᴅʀᴀᴡ
 ❏ ɢɪᴠᴇ 
 ❏ ʀᴏʙ 
 ❏ ʜᴇᴀᴠʏʀᴏʙ 
 ❏ ʟᴏᴀɴ
 ❏ ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ

⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬▬▬ ⬩ 𝗚 Ａ Ｍ Ｂ Ｌ Ｅ 
 ❏ ɢᴀᴍʙʟᴇ
 ❏ ᴄᴏɪɴғʟɪᴘ
 ❏ sʟᴏᴛs
 ❏ ᴅɪᴄᴇ
 ❏ ʙʟᴀᴄᴋᴊᴀᴄᴋ
 ❏ ʀᴏᴜʟᴇᴛᴛᴇ

⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬▬▬─ ⬩ 𝗚 𝗥 Ｏ Ｕ Ｐ 
 ❏ ᴀɴᴛɪʟɪɴᴋ
 ❏ ᴀɴᴛɪsᴛᴀᴛᴜs
 ❏ ᴋɪᴄᴋ
 ❏ ᴘʀᴏᴍᴏᴛᴇ
 ❏ ᴅᴇᴍᴏᴛᴇ
 ❏ ᴍᴜᴛᴇ
 ❏ ᴜɴᴍᴜᴛᴇ
 ❏ ᴛᴀɢᴀʟʟ
 ❏ ʜɪᴅᴇᴛᴀɢ

⬩╭────────────╮ 
⬩                                ╰──────╯⬩
▬▬▬▬▬▬ ⬩ 𝗦 Ｅ Ｃ 𝗨 𝗥 Ｉ Ｔ Ｙ 
 ❏ ᴀɴᴛɪʟɪɴᴋᴏɴ
 ❏ ᴀɴᴛɪʟɪɴᴋᴏғғ
 ❏ ᴀɴᴛɪᴄʜᴀɴɴᴇʟᴏɴ
 ❏ ᴀɴᴛɪᴄʜᴀɴɴᴇʟᴏғғ
 ❏ ᴀɴᴛɪsᴛᴀᴛᴜsᴏɴ
 ❏ ᴀɴᴛɪsᴛᴀᴛᴜsᴏғғ

⬩                                ╭──────╮⬩
⬩╰────────────╯`;
}
